Repository: sbn998/macros_app
Catalog: lib/l10n/app_*.arb
Languages: es

# addFood
source: Add some food
es: Añade alimentos

source: Food name
es: Nombre del alimento

# selectFood
source: Select your food
es: Selecciona tus alimentos

# selectMeal
source: Select your meal
es: Selecciona tu comida

source: Your macro goals
es: Tus macro-metas

# addNewGoal
source: Add a new goal
es: Añade una nueva meta

# addEditMeals
source: Add or Edit your meals
es: Añade o Edita tus comidas

# foodScreen
source: This is the Food screen
es: Esta es la ventana de los Alimentos

# noGoals
source: No goals for the day
es: No hay metas para el día

# enterMealName
source: Enter a meal name
es: Introduce el nombre de la comida

# addMeal
source: Add a meal
es: Añade una comida

# settingsAddEditMeals
source: Add/Edit your meals
es: Añade/Edita tus comidas

# settingsAddEditGoals
source: Add/Edit your goals
es: Añade/Edita tus metas

source: Macro goal name
es: Nombre de la Macro-meta

# labelsYourFood
source: Your Food
es: Tus Alimentos

# labelsMeals
source: Meals
es: Comidas

# labelsSettings
source: Settings
es: Opciones

# buttonsClose
source: Close
es: Cerrar

# buttonsConfirm
source: Confirm
es: Confirmar

# buttonsCancel
source: Cancel
es: Cancelar

# buttonsConfirmChanges
source: Confirm changes
es: Confirmar cambios

# buttonsStartAddingFood
source: Start adding food!
es: Empieza a añadir alimentos

# buttonsStartAddingGoal
source: Start by adding one
es: Empieza añadiendo una!

# buttonsLogMeal
source: Log your meals!
es: Anota tus comidas!

# buttonsAddFoodExclamation
source: Add food!
es: Añade alimentos!

# dateToday
source: Today
es: Hoy

# dateTomorrow
source: Tomorrow
es: Mañana

# dateYesterday
source: Yesterday
es: Ayer

# daysShortestMonday
source: M
es: L

# daysShortestTuesday
source: Tu
es: M

# daysShortestWednesday
source: W
es: X

# daysShortestThursday
source: Th
es: J

# daysShortestFriday
source: F
es: V

# daysShortestSunday
source: U
es: D

# screensYourFood
source: Your Food
es: Tus Alimentos

# screensSettings
source: Settings
es: Opciones

source: Calories
es: Calorías

source: Protein
es: Proteína

# carbs
source: Carbohydrates
es: Carbohidratos

source: Fats
es: Grasas

source: Serving Quantity
es: Tamaño de la porción

source: Serving Name
es: Nombre de la porción

# nullServingName
source: Please insert your serving unit(s).
es: Por favor, introduzca las unidades de su porción

# nullFoodName
source: Please write a name.
es: Por favor, introduzca un nombre.

# shortFoodName
source: Name must be at least 3 characters long.
es: El nombre debe contener al menos 3 caracteres.

# longFoodName
source: Name must be shorter than 40 characters.
es: El nombre debe contener menos de 40 caracteres.

# invalidDouble
source: Please enter a valid number.
es: Por favor, introduzca un número válido.
